БухЭксп/InformationRegisters/CW_ХарактеристикиЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиЗаказов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиЗаказов/Ext/ManagerModule.bsl
Функция ПолучитьЗначениеПараметра(Заказ, Параметр) Экспорт
	
	СтруктураЗначения = Новый Структура("Значение,ЗначениеПлан,ЗначениеФакт", Неопределено, Неопределено, Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ХарактеристикиЗаказов.Заказ КАК Заказ,
	               |	CW_ХарактеристикиЗаказов.Параметр КАК Параметр,
	               |	CW_ХарактеристикиЗаказов.Значение КАК Значение,
	               |	CW_ХарактеристикиЗаказов.ЗначениеПлан КАК ЗначениеПлан,
	               |	CW_ХарактеристикиЗаказов.ЗначениеФакт КАК ЗначениеФакт
	               |ИЗ
	               |	РегистрСведений.CW_ХарактеристикиЗаказов КАК CW_ХарактеристикиЗаказов
	               |ГДЕ
	               |	CW_ХарактеристикиЗаказов.Параметр = &Параметр
	               |	И CW_ХарактеристикиЗаказов.Заказ = &Заказ"; 
	
	Запрос.УстановитьПараметр("Заказ", 		Заказ);
	Запрос.УстановитьПараметр("Параметр",	Параметр); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураЗначения,Выборка);
	КонецЕсли;
	
	Возврат СтруктураЗначения;
	
КонецФункции  

Функция ПолучитьЗначенияПараметраОбъектов(МассивОбъектов, Параметр) Экспорт
	
	СоответствиеЗначений = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ХарактеристикиЗаказов.Заказ КАК Заказ,
	               |	CW_ХарактеристикиЗаказов.Параметр КАК Параметр,
	               |	CW_ХарактеристикиЗаказов.Значение КАК Значение,
	               |	CW_ХарактеристикиЗаказов.ЗначениеПлан КАК ЗначениеПлан,
	               |	CW_ХарактеристикиЗаказов.ЗначениеФакт КАК ЗначениеФакт,
	               |	CW_ХарактеристикиЗаказов.ЗначениеФакт КАК ХранилищеДанных
	               |ИЗ
	               |	РегистрСведений.CW_ХарактеристикиЗаказов КАК CW_ХарактеристикиЗаказов
	               |ГДЕ
	               |	CW_ХарактеристикиЗаказов.Параметр = &Параметр
	               |	И CW_ХарактеристикиЗаказов.Заказ В(&МассивОбъектов)"; 
	
	Запрос.УстановитьПараметр("МассивОбъектов", 	МассивОбъектов);
	Запрос.УстановитьПараметр("Параметр", 			Параметр); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл    
		
		СтруктураЗначения = CW_МониторинговыеПараметрыСервер.ПолучитьПустуюСтруктуруРедактированияПараметров();
		СтруктураЗначения.Значение 			= Выборка.Значение;
		СтруктураЗначения.ЗначениеПлан 		= Выборка.ЗначениеПлан;
		СтруктураЗначения.ЗначениеФакт 		= Выборка.ЗначениеФакт;  
		
		Если Параметр.СохранятьПолноеЗначениеПараметра Тогда
			СтруктураЗначения.ПолноеЗначение =  Выборка.ХранилищеДанных.Получить();
		КонецЕсли;
	
		СоответствиеЗначений.Вставить(Выборка.Грузоперевозка, СтруктураЗначения); 
	КонецЦикла;
	
	Возврат СоответствиеЗначений;
	
КонецФункции
